`02_pandas/homework_dataframe_251120.ipynb` 파일에서 작업하세요. #64

## 사원데이터 실습문제 

다음 데이터를 활용해 실습문제를 해결하세요.
| Name    | Age | City           | Salary |
|---------|-----|----------------|--------|
| Alice   | 25  | New York       | 70000  |
| Bob     | 30  | Los Angeles    | 80000  |
| Charlie | 35  | Chicago        | 120000 |
| David   | 40  | Houston        | 90000  |
| Eve     | 28  | San Francisco  | 75000  |


**문제 1: DataFrame객체 생성**

위의 데이터를 사용해 DataFrame객체를 생성하세요.

**문제 2: 열과 행 선택**

- `Name`과 `City` 열을 선택하여 출력하세요.
- 나이가 30 이상인 행을 선택하여 출력하세요.

**문제 3: 행과 열 추가**

- `Country` 열을 추가하고, 모두 'USA'로 설정하세요.
- 새로운 행을 추가하세요. (Name: Frank, Age: 33, City: Seattle, Salary: 85000)

**문제 4: 데이터 삭제**

- `Salary` 열을 삭제하세요.
- 'David'가 있는 행을 삭제하세요.

**문제 5: 데이터 수정**

- `Age`가 35 이상인 사람들의 `Salary`를 5% 증가시키세요.
- 'Alice'의 `City`를 'Boston'으로 수정하세요.

**문제 6: 데이터 타입 변환**

- `Age`와 `Salary`의 데이터 타입을 float로 변환하세요.


## 타이타닉데이터 생존율 집계

<img width="590" height="382" alt="Image" src="https://github.com/user-attachments/assets/d139225b-2ac7-4111-955c-8bf4e5955f34" />

[타이타닉 데이터 설명](https://www.notion.so/shqkel/2b19cb46e5e281f0b469e9a4dcfe2c5f?source=copy_link)

DataFrame를 이용해 제공된 데이터에서 성별과 클래스별 생존율을 효과적으로 출력하세요.

[titanic.csv 다운로드](https://github.com/user-attachments/files/23649393/titanic.csv)

**문제 1: DataFrame객체 생성**

위의 데이터를 사용해 DataFrame객체를 생성하세요.

In [32]:
import numpy as np
import pandas as pd

data = {
    'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age':[25, 30, 35, 40, 28],
    'City':['New York', 'Los Angeles', 'Chicago', 'Houston', 'San Francisco'],
    'Salary':[70000, 80000, 120000, 90000, 75000]
}

df = pd.DataFrame(data)
print(df.info())
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
 3   Salary  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes
None

      Name  Age           City  Salary
0    Alice   25       New York   70000
1      Bob   30    Los Angeles   80000
2  Charlie   35        Chicago  120000
3    David   40        Houston   90000
4      Eve   28  San Francisco   75000

# 문제 2: 열과 행 선택

In [12]:
# 1. Name과 City 열 선택
print(df[['Name', 'City']])

# 2. 나이가 30 이상인 행 선택
print(df[df['Age'] >= 30])

      Name           City
0    Alice       New York
1      Bob    Los Angeles
2  Charlie        Chicago
3    David        Houston
4      Eve  San Francisco
      Name  Age         City  Salary
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   40      Houston   90000

# 문제 3: 행과 열 추가

In [13]:
# 1. Country 열 추가 (모두 'USA')
df['Country'] = 'USA'
print(df)

# 2. 새로운 행 추가 (Frank, 33, Seattle, 85000)
new_row = {'Name': 'Frank', 'Age': 33, 'City': 'Seattle', 'Salary': 85000, 'Country': 'USA'}
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)
print(df)

      Name  Age           City  Salary Country
0    Alice   25       New York   70000     USA
1      Bob   30    Los Angeles   80000     USA
2  Charlie   35        Chicago  120000     USA
3    David   40        Houston   90000     USA
4      Eve   28  San Francisco   75000     USA
      Name  Age           City  Salary Country
0    Alice   25       New York   70000     USA
1      Bob   30    Los Angeles   80000     USA
2  Charlie   35        Chicago  120000     USA
3    David   40        Houston   90000     USA
4      Eve   28  San Francisco   75000     USA
5    Frank   33        Seattle   85000     USA

# 문제 4: 데이터 삭제

In [ ]:
# 1. Salary 열 삭제
df = df.drop(columns='Salary')
print(df)

# 2. 'David'가 있는 행 삭제
df = df[df['Name'] != 'David']
print(df)

      Name  Age           City Country
0    Alice   25       New York     USA
1      Bob   30    Los Angeles     USA
2  Charlie   35        Chicago     USA
3    David   40        Houston     USA
4      Eve   28  San Francisco     USA
5    Frank   33        Seattle     USA
      Name  Age           City Country
0    Alice   25       New York     USA
1      Bob   30    Los Angeles     USA
2  Charlie   35        Chicago     USA
4      Eve   28  San Francisco     USA
5    Frank   33        Seattle     USA

## 문제 5: 데이터 수정

Age가 35 이상인 사람들의 Salary를 5% 증가시키세요.
'Alice'의 City를 'Boston'으로 수정하세요.

In [ ]:
# 데이터 다시 로드 후 실행 
# # df.loc[df['Age'] >= 35, 'Salary'] = df.loc[df['Age'] >= 35, 'Salary'] * 1.05
df.loc[df['Age'] >= 35, 'Salary'] *= 1.05
df

      Name  Age           City  Salary
0    Alice   25       New York   70000
1      Bob   30    Los Angeles   80000
2  Charlie   35        Chicago  126000
3    David   40        Houston   94500
4      Eve   28  San Francisco   75000

In [22]:
df.loc[df['Name'] == 'Alice', 'City'] = 'Boston'
df

      Name  Age           City  Salary
0    Alice   25         Boston   70000
1      Bob   30    Los Angeles   80000
2  Charlie   35        Chicago  126000
3    David   40        Houston   94500
4      Eve   28  San Francisco   75000

In [23]:
# 검색
df[df['Name'] == 'Alice'] # []표현식
df.loc[df['Name'] == 'Alice', 'Age':'City'] # loc[] 인덱스/컬럼 라벨

   Age    City
0   25  Boston

## 문제 6: 데이터 타입 변환

Age와 Salary의 데이터 타입을 float로 변환하세요.

In [ ]:
# 값을 직접 변경
df['Age'] *= 1.0
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      float64
 2   City    5 non-null      object
 3   Salary  5 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [24]:
# astype
df['Age'] = df['Age'].astype(float)
df

      Name   Age           City  Salary
0    Alice  25.0         Boston   70000
1      Bob  30.0    Los Angeles   80000
2  Charlie  35.0        Chicago  126000
3    David  40.0        Houston   94500
4      Eve  28.0  San Francisco   75000

In [25]:
df = df.astype({'Age': float, 'Salary': float})

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      float64
 2   City    5 non-null      object
 3   Salary  5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

## 2. 타이타닉 데이터 생존율 집계

In [30]:
import pandas as pd

# 1. 데이터 로드 (파일 경로에 맞게 수정하세요)
df = pd.read_csv('data/titanic.csv') 

# (분석에 사용된 데이터 예시)
# ... (데이터 로드 부분 생략) ...

# 2. 성별(Sex)과 선실 등급(Pclass)별 생존율(Survived) 집계
# pivot_table을 사용하면 표 형태로 보기 좋게 정리됩니다.
survival_pivot = df.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='mean')

print("성별 및 클래스별 생존율:")
print(survival_pivot)

성별 및 클래스별 생존율:
Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447